# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(name)
print("end task -------------\n")


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём.

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(f"{name} {len(name)}")
print("end task -------------\n")


# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
  'Оля': False,  # если True, то пол мужской
  'Петя': True,
  'Вася': True,
  'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    if is_male[name]:
        print(f"{name} - Мужской")
    else:
        print(f"{name} - Женский")
print("end task -------------\n")


# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# В группе 2 ученика.
# В группе 3 ученика.

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]
print(f"Всего {len(groups)} группы")
print(f"В первой группе {len(groups[0])} ученика")
print(f"В первой группе {len(groups[1])} ученика")
print("end task -------------\n")


# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят.
# Пример:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]
for number, group in enumerate(groups, start=1):
    # print(f"Группа {number}: {[name for name in group]}")
    piople_names = ''
    for name in group:
        piople_names += name + ', '
    print(f"Группа {number}: {piople_names[:-2]}")
